import time

# 함수 실행 시간 측정하기(decorator) https://hoy.kr/YvCg9
# 1. 데코레이터에 사용되는 함수는 반드시 꾸며지는 대상 함수보다 먼저 정의되어야 한다.
# 2. 꾸며지는 대상은 함수 외에도 클래스도 가능하다.

def logging_time(original_fn):
    def wrapper_fn(*args, **kwargs):
        start_time = time.time()
        result = original_fn(*args, **kwargs)
        end_time = time.time()
        print("WorkingTime[{}]: {} sec".format(
            original_fn.__name__, end_time-start_time))
        return result
    return wrapper_fn

@logging_time
def my_func1():
    for i in range(100):
        print(i)
#######
# 초(secend) 로 시간(H,M,S) 구하기
def sec_to_hms(sec, div=60):
    min = sec // div
    _sec = sec % div
    if min > div:
        hour = min // div
        min = min % div
        return hour, min, _sec
    return min, _sec

# 초(secend) 로 시간(H,M,S) 구하기
def sec_to_hms_msg(sec, div=60):
    min = sec // div
    _sec = sec % div
    if _sec < 10:
        _sec = str(_sec).zfill(2)
    if min < 10:
        min = str(min).zfill(2)
    if int(min) > div:
        hour = int(min) // div
        min = int(min) % div
        if int(min) < 10:
            min = str(min).zfill(2)
        msg = f'{hour}:{min}:{_sec}'
        return msg
    msg = f'00:{min}:{_sec}'
    return msg


DZ_code_system = {
    '당좌자산' : list(range(101, 145 + 1)),
    '재고자산' : list(range(146, 175 + 1)),
    '투자자산' : list(range(176, 200 + 1)),      # NZ : 176~194
    '유형자산': list(range(201, 230 + 1)),       # NZ : 195~217
    '무형자산': list(range(231, 250 + 1)),       # NZ : 218~230
    '기타비유동자산': list(range(961, 980 + 1)),  # NZ : 231~250
    '유동부채' : list(range(251, 290+ 1)),
    '비유동부채' : list(range(291, 330 + 1)),
    '자본금' : list(range(331, 340 + 1)),
    '자본잉여금' : list(range(341, 350 + 1)),
    '이익잉여금':list(range(351, 380 + 1)),
    '자본조정': list(range(381, 400 + 1)),       # NZ : 381~391
    '기타포괄손익': list(range(981, 990 + 1)),   # NZ : 392~399

    '매출': list(range(401, 420 + 1)),          # NZ : 401~430
    '매출원가' : list(range(451, 470 + 1)),
    '제조원가' : list(range(501, 600 + 1)),
    '도급원가': list(range(601, 700 + 1)),      # NZ : 601~650
    '분양원가': list(range(701, 800 + 1)),      # NZ : 701~750
    '판매관리비' : list(range(801, 900 + 1)),
    '영업외수익': list(range(901, 930 + 1)),    # NZ : 901~950
    '영업외비용': list(range(931, 960 + 1)),    # NZ : 951~997
    '법인(소득)' : list(range(998, 999 + 1))    
    }

NZ_code_system = {
    '당좌자산' : list(range(101, 145 + 1)),
    '재고자산' : list(range(146, 175 + 1)),
    '투자자산' : list(range(176, 194 + 1)),      # DZ : 176~200
    '유형자산': list(range(195, 217 + 1)),       # DZ : 201~230
    '무형자산': list(range(218, 230 + 1)),       # DZ : 231~250
    '기타비유동자산': list(range(231, 250 + 1)),  # DZ : 961~980
    '유동부채' : list(range(251, 290 + 1)),
    '비유동부채' : list(range(291, 330 + 1)),
    '자본금' : list(range(331, 340 + 1)),
    '자본잉여금' : list(range(341, 350 + 1)),
    '이익잉여금' : list(range(351, 380 + 1)), 
    '자본조정': list(range(381, 391 + 1)),       # DZ : 381~400
    '기타포괄손익': list(range(392, 399 + 1)),   # DZ : 981~990

    '매출': list(range(401, 430 + 1)),          # DZ : 401~420
    '매출원가' : list(range(451, 470 + 1)),
    '제조원가' : list(range(501, 600 + 1)),
    '도급원가': list(range(601, 650 + 1)),      # DZ : 601~700
    '보관원가' : list(range(651, 700 + 1)),
    '분양원가': list(range(701, 750 + 1)),      # DZ : 701~800
    '운송원가' : list(range(751, 800 + 1)),
    '판매관리비' : list(range(801, 900 + 1)),
    '영업외수익': list(range(901, 950 + 1)),    # DZ : 901~930
    '영업외비용': list(range(951, 997 + 1)),    # DZ : 931~960
    '법인(소득)' : list(range(998, 999 + 1))
    }

NZ_uh_ass, DZ_uh_ass = [195,196,197,198,199,200] , [221,222,223,224,225,226]   # 유형자산
NZ_mh_ass, DZ_mh_ass = list(range(218, 230 + 1)), list(range(231, 243 + 1))    # 무형자산
NZ_etc_ass, DZ_etc_ass = list(range(231, 250 + 1)), list(range(961, 980 + 1))    # 기타비유동자산
NZ_jbjj_cap, DZ_jbjj_cap = [389, 390, 391], [394, 395, 396]   # 자본조정 : 감자차손, 자기주식처분손실, 주식매입선택권
NZ_etcpg_is, DZ_etcpg_is = [392, 393, 394, 395, 396, 397, 398, 399], [987,988, 981, 982, 983, 984, 985, 986]   # 기타포괄손익 :

Dif_NzDzCode = [
                (183, 187),
                (184, 192),
                (185, 197),
                (186, 198),
                (187, 199),
                (188, 200),
                (199, 217),
                (200, 218),
                (196, 220),
                (198, 222),
                (218, 231),
                (219, 232),
                (220, 233),
                (221, 234),
                (222, 235),
                (223, 236),
                (224, 237),
                (225, 238),
                (226, 239),
                (227, 240),
                (375, 377),
                (389, 394),
                (390, 395),
                (391, 396),
                (951, 931),
                (952, 932),
                (953, 933),
                (954, 934),
                (955, 935),
                (956, 936),
                (957, 937),
                (958, 938),
                (959, 939),
                (960, 940),
                (961, 941),
                (962, 942),
                (963, 943),
                (964, 944),
                (967, 947),
                (968, 948),
                (969, 949),
                (970, 950),
                (971, 951),
                (977, 957),
                (980, 960),
                (231, 961),
                (232, 962),
                (233, 963),
                (234, 964),
                (235, 965),
                (236, 966),
                (237, 967),
                (238, 968),
                (239, 969),
                (240, 970),
                (241, 971),
                (242, 972),
                (243, 973),
                (244, 974),
                (245, 975),
                (246, 976),
                (247, 977),
                (248, 978),
                (394, 981),
                (395, 982),
                (396, 983),
                (397, 984),
                (398, 985),
                (399, 986)
                ]
                
fromNzCode = [x[0] for x in Dif_NzDzCode]
toDzCode = [x[1] for x in Dif_NzDzCode]

Dz_Card = [ 146,153,156,159,162,166,167,168,                       # 더존 카드사용여부
            202,204,206,208,210,212,214,215,217,219,221,223,225,227,229,231,232,233,234,235,236,237,238,239,240,
            511,512,514,515,516,517,519,520,521,522,523,524,525,526,527,528,529,530,531,532,533,534,535,536,
            610,611,612,614,615,616,617,619,620,621,622,623,624,625,626,627,628,629,630,631,632,633,634,635,636,637,638,639,640,
            710,711,712,714,715,716,717,719,720,721,722,723,724,725,726,727,728,729,730,731,732,733,734,735,736,737,
            811,812,814,815,816,817,819,820,821,822,823,824,825,826,827,828,829,830,831,832,833,834,836,837,838,839,841,842,843,844,845,846,847,848,
            931,947 ] 

접대비계정 = [513,613,713,813]






